{
  "backend/main.mo": "Main Motoko actor defining all data types (UserRole, PatientRecord, Appointment, Device, etc.), initializing access control and user approval state, including authorization and storage mixins, and implementing healthcare platform business logic with RBAC, audit logging, and medical data management.",
  "feature_evidence.json": "Feature evidence report documenting implementation of Ctrl+Q admin keyboard shortcut with role-based access control, silent navigation for admins, access denial with toast for unauthorized users, and smooth animations consistent with medical theme design system.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing component purposes, including theme system, routing, RBAC hooks, patient/doctor/admin dashboards, forms, and the useAdminShortcut hook implementation.",
  "frontend/index.css": "Tailwind CSS configuration with light/dark theme CSS variables defining medical-themed color palette (soft whites, medical blues, alert colors), border radius, and sidebar styling using HSL color space.",
  "frontend/index.html": "HTML entry point with meta tags for MediCrew application description, keywords for SEO, and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Main React application component managing authentication flow, role-based routing between landing/patient/doctor/admin views, profile setup detection, admin shortcut hook integration, role expiration monitoring with toast notifications, and theme provider setup.",
  "frontend/src/components/admin/AdminManagement.tsx": "Admin management dashboard for super admins to view all admins, grant/revoke admin access, extend temporary admin expiration dates, and monitor admin role status with real-time data refresh capabilities.",
  "frontend/src/components/admin/AdminSidebar.tsx": "Navigation sidebar for the admin dashboard with sections for users, doctors, devices, appointments, admin management, and audit logs, with visibility controls based on super admin status.",
  "frontend/src/components/admin/AppointmentsManagement.tsx": "Admin component for viewing and managing appointments with status filtering, statistics cards, and an override modal. Displays appointments in a table with real-time refresh and data staleness indicators.",
  "frontend/src/components/admin/ApprovalManagement.tsx": "Admin component for managing user approval requests with approve/reject actions and doctor verification. Shows pending, approved, and rejected counts with a table of approval requests.",
  "frontend/src/components/admin/AuditLogsManagement.tsx": "Admin component for viewing and filtering audit logs with search, action filtering, and CSV export functionality. Displays system events and admin actions in a table with color-coded badges.",
  "frontend/src/components/admin/DevicesManagement.tsx": "Admin component for managing IoT devices with status toggling, unlinking, and reassignment capabilities. Shows device statistics and filtered table with sync status and linked patient information.",
  "frontend/src/components/admin/DoctorsManagement.tsx": "Admin component for managing doctor approvals with approve/reject actions and automatic verification. Displays filtered doctor applications with confirmation dialogs and status statistics.",
  "frontend/src/components/admin/ExtendExpiryModal.tsx": "Modal dialog component for extending admin user expiration dates. Allows selecting a new datetime and converts it to nanosecond timestamp for backend storage.",
  "frontend/src/components/admin/FacilityManagement.tsx": "Admin component for managing medical facilities (hospitals/clinics) with a form to add new facilities including name, address, phone, type, distance, and GPS coordinates. Displays a list of existing facilities with loading states and uses React Query hooks for data fetching and mutations.",
  "frontend/src/components/admin/GrantTemporaryAccessModal.tsx": "Modal dialog for granting temporary admin access to a user with preset durations (1 hour, 24 hours, 7 days) or custom date/time selection. Converts selected duration to nanosecond timestamps for the backend.",
  "frontend/src/components/admin/OverrideAppointmentModal.tsx": "Modal dialog allowing admins to override appointment status (pending, confirmed, completed, cancelled) with an optional reason field. Uses React Query mutation to update appointment status.",
  "frontend/src/components/admin/ReassignDeviceModal.tsx": "Modal dialog for reassigning an IoT device to a different patient by entering their Principal ID. Validates the Principal format and uses the linkDevice mutation hook.",
  "frontend/src/components/admin/UsersManagement.tsx": "Admin dashboard for managing users with search/filter capabilities, displaying admin roles with color-coded badges, and actions to promote/revoke admin privileges. Includes data freshness indicators and integrates with GrantTemporaryAccessModal.",
  "frontend/src/components/ApprovalStatus.tsx": "Alert component displaying user approval status with success/pending states, color-coded badges (green for approved, amber for pending), and a button to request approval from admins.",
  "frontend/src/components/doctor/AddPatient.tsx": "Doctor interface form for adding a new patient to monitoring by entering their Principal ID and IoT device ID. Includes validation, loading states, and a consent reminder notice.",
  "frontend/src/components/doctor/DoctorRegistration.tsx": "React component for doctor registration form with name and specialty fields, submitting to backend via useRegisterDoctor hook and displaying pending verification status after submission.",
  "frontend/src/components/doctor/DoctorVerification.tsx": "React component for doctor credential verification allowing file upload of medical certificates and specialty selection, displaying pending status after submission (appears to be a mock/UI-only implementation).",
  "frontend/src/components/doctor/NotificationsList.tsx": "Displays critical patient alerts with urgency levels (Critical/Warning), showing mock notification data with patient vitals, device IDs, and time stamps with color-coded urgency indicators.",
  "frontend/src/components/doctor/PatientList.tsx": "Shows a grid of patient cards with mock vital signs data (heart rate, SpO2, temperature, blood pressure), status badges, and mini trend charts using Recharts library.",
  "frontend/src/components/doctor/PatientSearch.tsx": "Allows doctors to search patient records by principal ID using useGetPatientRecordsByUser hook, displaying vitals and medical records with severity indicators and formatted timestamps.",
  "frontend/src/components/Footer.tsx": "Footer component with caffeine.ai attribution including dynamic UTM tracking parameters based on hostname, heart icon in primary color, current year, and Internet Computer branding.",
  "frontend/src/components/Header.tsx": "Main application header component that displays branding, user authentication status, role badges with expiration timers for temporary admins, and handles login/logout functionality with Internet Identity integration.",
  "frontend/src/components/HospitalLocator.tsx": "Hospital locator component that displays a map and searchable list of medical facilities with filtering by name or type, supporting both real and mock data modes for development.",
  "frontend/src/components/patient/AIHelpDesk.tsx": "Multi-step AI health assistant component that allows patients to upload medical images, describe symptoms, receive AI analysis with urgency levels, and find nearby doctors. Includes mock mode support and simulated diagnosis with polling pattern.",
  "frontend/src/components/patient/AppointmentBooking.tsx": "Multi-step appointment booking dialog that allows patients to select a verified doctor, choose date/time from available slots, provide appointment details, and confirm booking. Includes doctor profile cards with verification badges.",
  "frontend/src/components/patient/DeviceMonitor.tsx": "IoT medical device monitoring component that connects to devices via device ID and displays real-time vitals (heart rate, SpO2, temperature, blood pressure) with status indicators and alerts using polling pattern.",
  "frontend/src/components/patient/HealthInsights.tsx": "AI-powered health insights dashboard that analyzes patient vitals and symptoms, displays trend charts using Recharts, generates health alerts based on thresholds, and provides personalized health recommendations.",
  "frontend/src/components/patient/HealthRecords.tsx": "Displays patient health records (vitals or symptoms) in a scrollable list with formatted timestamps, severity badges for symptoms, and detailed vital sign measurements including blood pressure, heart rate, temperature, and oxygen saturation.",
  "frontend/src/components/patient/SymptomsForm.tsx": "Form component for patients to log symptoms with description textarea and severity level selector (1-5 scale). Includes form validation and success/error toast notifications.",
  "frontend/src/components/patient/VitalsForm.tsx": "React component that renders a form for patients to log vital signs (blood pressure, heart rate, temperature, oxygen saturation) with validation and toast notifications.",
  "frontend/src/components/ProfileSetup.tsx": "Initial profile setup form that allows new users to enter their name and creates a patient profile with default role settings.",
  "frontend/src/components/RoleSelection.tsx": "Role selection interface allowing users to register as either a patient or doctor, with doctors providing additional information like name and medical specialty for verification.",
  "frontend/src/config/env.ts": "Environment configuration module that validates required environment variables (canister ID, network) and enables mock mode for development when canister ID is missing.",
  "frontend/src/config/features.ts": "Feature flags configuration system that allows enabling/disabling features (vitals tracking, appointments, help desk, etc.) via environment variables for incremental deployment.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating it with the current identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminShortcut.ts": "Custom hook that implements a Ctrl+Q keyboard shortcut for navigating to the admin dashboard, only active when authenticated and not typing in input fields.",
  "frontend/src/hooks/useAnimatedCounter.ts": "Custom hook that animates a counter from start to end value over a specified duration using easeOutQuart easing for smooth transitions.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for managing Internet Identity authentication, providing login/logout functionality and identity state management with AuthClient integration.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that uses IntersectionObserver API to track when an element enters the viewport, returning both current and historical intersection state.",
  "frontend/src/hooks/useMagneticHover.ts": "Custom hook that creates a subtle magnetic hover effect by tracking mouse position relative to an element and calculating offset for smooth animations.",
  "frontend/src/hooks/useParallax.ts": "Custom hook that provides a parallax scrolling effect by calculating vertical offset based on scroll position and a configurable speed multiplier.",
  "frontend/src/hooks/useQueries.ts": "Comprehensive collection of React Query hooks for all backend operations including user profiles, RBAC roles, vitals, appointments, facilities, devices, and audit logs with automatic polling and cache invalidation.",
  "frontend/src/hooks/useReducedMotion.ts": "Custom hook that detects user's prefers-reduced-motion system preference using media queries for accessibility-aware animations.",
  "frontend/src/hooks/useScrollDirection.ts": "Custom hook that tracks scroll direction (up/down) by comparing current scroll position with previous position, useful for hiding/showing navigation bars.",
  "frontend/src/hooks/useVisibilityPolling.ts": "Custom hook that provides visibility-aware polling intervals for React Query, pausing polling when the browser tab is inactive to save resources.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom medical-themed design tokens including color schemes (primary medical blue, alert colors for normal/warning/critical), typography settings, and utility classes for glassmorphism, shadows, glows, and animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with role-based access control that displays different management sections (users, doctors, devices, appointments, admin management, audit logs) via a sidebar navigation, with super admin features restricted to that role.",
  "frontend/src/pages/DoctorDashboard.tsx": "Doctor dashboard page with tabbed interface for patient record search and hospital locator features, controlled by feature flags.",
  "frontend/src/pages/DoctorHome.tsx": "Doctor home page showing overview statistics (active patients, critical alerts, monitoring) and navigation cards to access patient list, notifications, and add patient functionality.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, animated feature sections showcasing AI medical assistance and platform capabilities, and call-to-action buttons for patient and doctor login via Internet Identity.",
  "frontend/src/pages/LoginPage.tsx": "Login page with hero section and feature cards highlighting platform capabilities like vitals tracking, data visualization, and doctor verification, directing users to authenticate via header login button.",
  "frontend/src/pages/PatientDashboard.tsx": "Patient dashboard with tabbed interface for logging vitals, symptoms, viewing health insights, and locating hospitals. Uses feature flags to conditionally render tabs and content with animated card layouts.",
  "frontend/src/pages/PatientHome.tsx": "Patient home page displaying real-time health vitals (heart rate, SpO2, temperature) with animated counters, device connection status, and quick access to AI help desk, appointment booking, and device monitoring features.",
  "frontend/src/utils/csvExport.ts": "Utility function to export audit logs to CSV format with headers for timestamp, performer, action, target user, and metadata, triggering automatic download.",
  "frontend/src/utils/relativeTime.ts": "Converts timestamps to human-readable relative time strings (e.g., '2 days ago', '5 minutes ago') for displaying update times.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter utilities supporting both regular query strings and hash-based routing, with sessionStorage persistence for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space, extended spacing/typography scales, soft shadows, custom animations (accordion, fade, pulse), and responsive container settings for the healthcare UI theme.",
  "project_state.json": "Project metadata describing MediCrew as a premium healthcare platform with calm light-themed design, simulated real-time vitals, multi-admin RBAC system, and hybrid UI combining immersive depth with medical clarity using toned-down animations and React Query caching."
}