{
  "backend/main.mo": "Main Motoko actor implementing a healthcare platform with patient records (vitals, symptoms), doctor profiles, appointments, medical facilities, user approvals, access control, and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (landing page, navigation, scroll effects, dashboards, appointment booking, etc.) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the Igloo-style design system, authentication flow, role-based routing, patient/doctor/admin dashboards, and various UI components with glass morphism and cinematic animations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with meta tags for MediCrew healthcare platform, mounting React app to #root div and loading main.tsx module.",
  "frontend/src/App.tsx": "Root React component managing authentication state, role detection (guest/patient/doctor/admin), doctor registration checks, and conditional rendering of landing page, role selection, or role-specific dashboards with loading states.",
  "frontend/src/components/admin/ApprovalManagement.tsx": "Admin interface for managing user approval requests, displaying pending/approved/rejected counts and a table with actions to approve, reject, or verify doctors.",
  "frontend/src/components/admin/FacilityManagement.tsx": "Admin component for viewing and adding medical facilities with a form to input facility details including name, address, phone, type, and GPS coordinates.",
  "frontend/src/components/ApprovalStatus.tsx": "Alert component displaying user approval status with success/pending states, showing checkmark for approved users or clock icon with 'Request Approval' button for pending users.",
  "frontend/src/components/doctor/AddPatient.tsx": "Doctor interface for adding patients to their monitoring list by entering patient principal ID and device ID with consent reminder.",
  "frontend/src/components/doctor/DoctorRegistration.tsx": "React component for doctor registration form that collects name and specialty, submits via useRegisterDoctor hook, and displays a pending verification status after successful submission.",
  "frontend/src/components/doctor/DoctorVerification.tsx": "React component for doctor credential verification that allows uploading medical degree certificates and selecting specialty, showing a pending status card after submission.",
  "frontend/src/components/doctor/NotificationsList.tsx": "React component displaying a list of patient notifications with urgency levels (Critical/Warning), showing vital signs and providing view/dismiss actions for each alert.",
  "frontend/src/components/doctor/PatientList.tsx": "React component showing a grid of patient cards with status badges (Normal/Warning/Critical), vital signs, trend charts using Recharts, and animated counters for each patient.",
  "frontend/src/components/doctor/PatientSearch.tsx": "React component for searching patient records by principal ID using useGetPatientRecordsByUser hook, displaying vitals and medical records with severity indicators in a scrollable area.",
  "frontend/src/components/Footer.tsx": "Footer component with caffeine.ai attribution, heart icon, copyright notice, and Internet Computer branding using glass-card styling.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with MediCrew logo, scroll-based hide/reveal animation, glass morphism styling, and login/logout button with authentication state management.",
  "frontend/src/components/HospitalLocator.tsx": "Displays a searchable map and list of medical facilities with filtering, zoom controls, and animated facility cards showing location, contact, and type information.",
  "frontend/src/components/patient/AIHelpDesk.tsx": "A modal component that provides AI-powered symptom analysis with image upload, multi-step processing simulation, urgency assessment, first aid recommendations, and nearby doctor suggestions.",
  "frontend/src/components/patient/AppointmentBooking.tsx": "A multi-step dialog component for booking appointments with verified doctors, including doctor selection, date/time picking, appointment details entry, and confirmation with simulated booking process.",
  "frontend/src/components/patient/DeviceMonitor.tsx": "A modal component for connecting and monitoring IoT medical devices, displaying real-time vitals (heart rate, SpO2, temperature, blood pressure) with simulated data updates and status indicators.",
  "frontend/src/components/patient/HealthInsights.tsx": "Displays AI-powered health insights by analyzing patient vitals and symptoms, showing trend charts with Recharts, health alerts categorized by severity, and personalized health recommendations.",
  "frontend/src/components/patient/HealthRecords.tsx": "A card component that displays either vitals or symptoms history in a scrollable list, formatting timestamps and showing severity badges for symptoms or vital sign measurements.",
  "frontend/src/components/patient/SymptomsForm.tsx": "A form component for logging patient symptoms with description textarea and severity level selector (1-5 scale), using mutation hook to submit data and displaying toast notifications.",
  "frontend/src/components/patient/VitalsForm.tsx": "A form component for patients to log vital signs (blood pressure, heart rate, temperature, oxygen saturation) with validation and toast notifications.",
  "frontend/src/components/ProfileSetup.tsx": "Empty file with no content.",
  "frontend/src/components/RoleSelection.tsx": "Provides role selection UI for users to register as either a patient or doctor, with a form for doctors to submit name and specialty for verification.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, automatically recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAnimatedCounter.ts": "Custom hook that animates a number from start to end value over a specified duration using easeOutQuart easing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that tracks whether an element is intersecting the viewport using IntersectionObserver API, with persistent state for first intersection.",
  "frontend/src/hooks/useMagneticHover.ts": "Custom hook that creates a magnetic hover effect by calculating element position offset based on mouse movement relative to element center.",
  "frontend/src/hooks/useParallax.ts": "Custom hook that calculates parallax scroll offset based on window scroll position and configurable speed multiplier.",
  "frontend/src/hooks/useQueries.ts": "Centralized collection of React Query hooks for all backend API calls including user roles, approvals, patient records, vitals, symptoms, doctors, and facilities.",
  "frontend/src/hooks/useReducedMotion.ts": "Custom hook that detects user's prefers-reduced-motion system preference for accessibility.",
  "frontend/src/hooks/useScrollDirection.ts": "Custom hook that tracks scroll direction (up/down) based on window scroll position changes.",
  "frontend/src/index.css": "Global styles with Tailwind configuration, defining CSS custom properties for light/dark themes using OKLCH color space with electric blue accents and glass morphism utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabs for managing user approvals and medical facilities. Uses ApprovalManagement and FacilityManagement components.",
  "frontend/src/pages/DoctorDashboard.tsx": "Doctor dashboard that shows registration form if not approved, otherwise displays tabs for patient records and hospital locator. Includes approval status check.",
  "frontend/src/pages/DoctorHome.tsx": "Doctor home page with slim vertical navigation, animated stat counters, and views for notifications, adding patients, and patient lists. Features glass-morphism UI design.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, animated background, parallax effects, and magnetic hover interactions. Includes Internet Identity login integration.",
  "frontend/src/pages/LoginPage.tsx": "Login/marketing page showcasing MediCrew features with hero section, feature cards for vitals tracking, data visualization, and doctor verification. Directs users to header login button.",
  "frontend/src/pages/PatientDashboard.tsx": "Patient dashboard with tabs for logging vitals, symptoms, viewing health insights, and finding hospitals. Includes approval status display and health records.",
  "frontend/src/pages/PatientHome.tsx": "Patient home page with animated health status cards, real-time vitals display, device monitoring, AI help desk, and appointment booking features. Uses glass-morphism design.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended spacing/typography, border radius variables, custom shadows, and animation keyframes for a dark-themed design system.",
  "project_state.json": "Project state file documenting MediCrew as an ultra-premium healthcare web app with igloo.inc-inspired dark UI, glass morphism, cinematic animations, patient dashboard, doctor mission control, and Help Desk system with simulated real-time data."
}