{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Hidden Keyboard Shortcut (Ctrl + Q) for Admin Dashboard Navigation",
  "requirements": [
    {
      "id": "REQ-70",
      "summary": "Implement global keyboard listener for Ctrl + Q shortcut that navigates to /admin route, only active when user is authenticated and inside the application, blocked when active element is an input field, textarea, or contenteditable element",
      "acceptanceCriteria": [
        "Keyboard listener is attached globally when user is authenticated and inside the app",
        "Ctrl + Q navigates to /admin route",
        "Shortcut does not work on landing page or during authentication screens",
        "Shortcut is blocked when focus is on input, textarea, or contenteditable elements",
        "Browser default behavior for Ctrl + Q is prevented if necessary"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminShortcut.ts",
          "operation": "create",
          "description": "Create custom React hook that manages the Ctrl + Q keyboard shortcut listener. The hook should accept authentication status and current location as parameters, attach a global keydown event listener when authenticated and not on landing/login pages, check if the active element is an input/textarea/contenteditable before allowing navigation, prevent default browser behavior for Ctrl + Q, and use React Router's navigate function to programmatically navigate to /admin route. The hook should clean up the event listener on unmount and re-attach when dependencies change."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the useAdminShortcut hook into the main App component. Import the new hook and call it with the current authentication status from useInternetIdentity and the current location from useLocation. Ensure the hook is only active after the user has completed profile setup and is authenticated. Position the hook call after the authentication and profile loading logic but before the route rendering to ensure it's active throughout the authenticated session."
        }
      ]
    },
    {
      "id": "REQ-71",
      "summary": "Configure keyboard shortcut to navigate silently to /admin for Admin and SuperAdmin users without any toast notifications, confirmations, or visual feedback",
      "acceptanceCriteria": [
        "Admin and SuperAdmin users navigate directly to /admin without any visual feedback",
        "No toast notifications appear for authorized users",
        "Navigation is immediate and smooth",
        "Premium silent navigation experience maintained"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminShortcut.ts",
          "operation": "modify",
          "description": "Ensure the keyboard shortcut handler performs only navigation without triggering any toast notifications or visual feedback. The navigation should be a simple programmatic route change using navigate('/admin') with no additional side effects. Do not call any toast functions or display any UI feedback within this hook."
        }
      ]
    },
    {
      "id": "REQ-72",
      "summary": "For Patient or Doctor users pressing Ctrl + Q, navigate to /admin route, allow backend to validate role and deny access, then redirect unauthorized users to their appropriate dashboard with 'Access Denied.' toast notification displayed using red destructive styling",
      "acceptanceCriteria": [
        "Patient and Doctor users can trigger Ctrl + Q shortcut",
        "Navigation to /admin occurs first",
        "Backend role validation executes on /admin route access",
        "Unauthorized users are redirected to their appropriate dashboard",
        "'Access Denied.' toast appears with red destructive styling",
        "Backend determines access authority, not frontend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add role-based access validation logic at the top of the AdminDashboard component. Use the getUserRole hook to fetch the current user's role from the backend. If the role is Patient or Doctor (not Admin or SuperAdmin), immediately redirect to the appropriate dashboard (/patient-home for Patient, /doctor-home for Doctor) using navigate, and display a toast notification with the message 'Access Denied.' using the destructive variant for red styling. Ensure this check happens after the component mounts and role data is fetched. The backend performs the authoritative role validation; this frontend logic handles the user experience for unauthorized access attempts."
        }
      ]
    },
    {
      "id": "REQ-73",
      "summary": "Remove all visible Admin navigation links from Header component and any sidebar navigation for all user roles, ensuring admin dashboard access is only available via direct URL /admin or Ctrl + Q keyboard shortcut",
      "acceptanceCriteria": [
        "Header component does not display Admin link for any user role",
        "Sidebar navigation (if present) does not show Admin section",
        "Admin dashboard remains accessible via /admin URL and Ctrl + Q shortcut",
        "Cleaner UI with reduced navigation clutter",
        "Clear separation between governance layer and user dashboards"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Remove any Admin navigation link or button from the Header component. Search for any conditional rendering based on admin/superAdmin roles that displays an Admin link or navigation item, and delete those sections entirely. Ensure the Header only shows the login/logout functionality, role badges, and admin expiration timer without any navigation links to the admin dashboard. The admin dashboard should no longer be accessible through visible UI elements in the header."
        },
        {
          "path": "frontend/src/components/admin/AdminSidebar.tsx",
          "operation": "modify",
          "description": "Review the AdminSidebar component to confirm it only provides internal navigation within the admin dashboard (Users, Doctors, Devices, etc.) and does not include a link back to the main app or any external navigation that would create visible admin access points. The sidebar should remain functional for navigating between admin sections but should not be rendered outside the AdminDashboard page context."
        }
      ]
    },
    {
      "id": "REQ-74",
      "summary": "Ensure keyboard shortcut implementation uses smooth route transition animations consistent with the existing light medical theme design system",
      "acceptanceCriteria": [
        "Route transitions are smooth and use ease-in-out timing",
        "Navigation matches existing page transition animations",
        "No jarring movements or aggressive effects",
        "Premium clean UI experience maintained",
        "Consistent with light medical theme design system"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminShortcut.ts",
          "operation": "modify",
          "description": "Use React Router's navigate function with default transition behavior to ensure smooth route changes. The programmatic navigation should inherit the existing route transition animations defined in the application's routing configuration. Do not add custom transition logic within the shortcut handler; rely on the application's existing transition system to maintain consistency with the light medical theme design system and ensure ease-in-out timing for premium user experience."
        }
      ]
    },
    {
      "id": "REQ-75",
      "summary": "Implement keyboard shortcut with no visible indicators or hints of its existence in the UI, maintaining stealthy access approach",
      "acceptanceCriteria": [
        "No tooltips or help text mentioning Ctrl + Q shortcut",
        "No visual indicators in UI revealing shortcut existence",
        "Shortcut remains hidden discovery feature",
        "Stealthy implementation approach maintained"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminShortcut.ts",
          "operation": "modify",
          "description": "Ensure the keyboard shortcut hook implementation contains no console.log statements, debug messages, or any code that would reveal the shortcut's existence to users inspecting the application. The hook should operate silently in the background without any trace in the UI or developer tools during normal operation. Use production-safe code that does not expose the shortcut mechanism through logging or debugging artifacts."
        }
      ]
    }
  ]
}